In [1]:
import pandas as pd

In [3]:
df=pd.read_csv("students_dataset.csv")

In [4]:
df.tail

<bound method NDFrame.tail of      Student_ID   Name  Gender   Age  Marks  Study_Hours Department  \
0          1009  Rahul       F   NaN   49.0         10.0         IT
1          1015   Ravi       F  20.0   38.0          7.0       Mech
2          1064  Karan       F  23.0   54.0          5.0      Civil
3          1028   Ravi  Female  23.0   75.0         10.0      Civil
4          1089   Amit    Male   NaN   74.0          5.0       Mech
..          ...    ...     ...   ...    ...          ...        ...
585        1031   Asha       F  22.0   60.0          8.0        NaN
586        1057    NaN       F  20.0   44.0          3.0      Civil
587        1036  Karan     NaN   NaN   38.0          5.0       Mech
588        1027  Rahul  Female  20.0   89.0          8.0       ENTC
589        1018   Neha       M   NaN   68.0          NaN         CS

     Attendance
0          40.0
1          51.0
2          99.0
3          47.0
4          42.0
..          ...
585        97.0
586        83.0
587        90.0
588        46.0
589        57.0

[590 rows x 8 columns]>

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 590 entries, 0 to 589
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Student_ID   590 non-null    int64
 1   Name         527 non-null    object
 2   Gender       480 non-null    object
 3   Age          509 non-null    float64
 4   Marks        586 non-null    float64
 5   Study_Hours  533 non-null    float64
 6   Department   502 non-null    object
 7   Attendance   582 non-null    float64
dtypes: float64(4), int64(1), object(3)
memory usage: 37.0+ KB

In [6]:
df.describe()

        Student_ID        Age       Marks  Study_Hours  Attendance
count   590.000000  509.00000  586.000000   533.000000  582.000000
mean   1049.389831   20.59332   68.573379     5.369606   70.147766
std      29.466575    1.64629   19.271579     2.837778   17.446219
min    1000.000000   18.00000   35.000000     1.000000   40.000000
25%    1025.000000   19.00000   52.000000     3.000000   56.000000
50%    1049.000000   21.00000   69.000000     5.000000   70.000000
75%    1077.000000   22.00000   85.000000     8.000000   85.000000
max    1099.000000   23.00000  100.000000    10.000000  100.000000

In [7]:
df.columns

Index(['Student_ID', 'Name', 'Gender', 'Age', 'Marks', 'Study_Hours',
       'Department', 'Attendance'],
      dtype='object')

In [8]:
df["Attendance"]

0      40.0
1      51.0
2      99.0
3      47.0
4      42.0
       ...
585    97.0
586    83.0
587    90.0
588    46.0
589    57.0
Name: Attendance, Length: 590, dtype: float64

In [9]:
df[['Student_ID','Name','Gender','Marks']]

     Student_ID   Name  Gender  Marks
0          1009  Rahul       F   49.0
1          1015   Ravi       F   38.0
2          1064  Karan       F   54.0
3          1028   Ravi  Female   75.0
4          1089   Amit    Male   74.0
..          ...    ...     ...    ...
585        1031   Asha       F   60.0
586        1057    NaN       F   44.0
587        1036  Karan     NaN   38.0
588        1027  Rahul  Female   89.0
589        1018   Neha       M   68.0

[590 rows x 4 columns]

# DATA CLEANING

In [10]:
df.isnull()

,Student_ID,Name,Gender,Age,Marks,Study_Hours,Department,Attendance
0,False,False,False,True,False,False,False,False
1,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False
4,False,False,False,True,False,False,False,False
...,...,...,...,...,...,...,...,...
585,False,False,False,False,False,False,True,False
586,False,True,False,False,False,False,False,False
587,False,False,True,True,False,False,False,False
588,False,False,False,False,False,False,False,False
589,False,False,False,True,False,True,False,False

In [11]:
df.isnull().sum()

Student_ID       0
Name            63
Gender         110
Age             81
Marks            4
Study_Hours     57
Department      88
Attendance       8
dtype: int64

In [12]:
#fill null value
df["Age"]=df["Age"].fillna(df["Age"].mean())
df.head()

,Student_ID,Name,Gender,Age,Marks,Study_Hours,Department,Attendance
0,1009,Rahul,F,20.59332,49.0,10.0,IT,40.0
1,1015,Ravi,F,20.00000,38.0,7.0,Mech,51.0
2,1064,Karan,F,23.00000,54.0,5.0,Civil,99.0
3,1028,Ravi,Female,23.00000,75.0,10.0,Civil,47.0
4,1089,Amit,Male,20.59332,74.0,5.0,Mech,42.0

In [15]:
df["Marks"]=df["Marks"].fillna(df["Marks"].mean())
df.head()

,Student_ID,Name,Gender,Age,Marks,Study_Hours,Department,Attendance
0,1009,Rahul,F,20.59332,49.0,10.0,IT,40.0
1,1015,Ravi,F,20.00000,38.0,7.0,Mech,51.0
2,1064,Karan,F,23.00000,54.0,5.0,Civil,99.0
3,1028,Ravi,Female,23.00000,75.0,10.0,Civil,47.0
4,1089,Amit,Male,20.59332,74.0,5.0,Mech,42.0

In [16]:
df["Study_Hours"]=df["Study_Hours"].fillna(df["Study_Hours"].mean())
df.head()

,Student_ID,Name,Gender,Age,Marks,Study_Hours,Department,Attendance
0,1009,Rahul,F,20.59332,49.0,10.0,IT,40.0
1,1015,Ravi,F,20.00000,38.0,7.0,Mech,51.0
2,1064,Karan,F,23.00000,54.0,5.0,Civil,99.0
3,1028,Ravi,Female,23.00000,75.0,10.0,Civil,47.0
4,1089,Amit,Male,20.59332,74.0,5.0,Mech,42.0

In [17]:
df["Attendance"] = df["Attendance"].fillna(df["Attendance"].mean())
df

,Student_ID,Name,Gender,Age,Marks,Study_Hours,Department,Attendance
0,1009,Rahul,F,20.59332,49.0,10.000000,IT,40.0
1,1015,Ravi,F,20.00000,38.0,7.000000,Mech,51.0
2,1064,Karan,F,23.00000,54.0,5.000000,Civil,99.0
3,1028,Ravi,Female,23.00000,75.0,10.000000,Civil,47.0
4,1089,Amit,Male,20.59332,74.0,5.000000,Mech,42.0
...,...,...,...,...,...,...,...,...
585,1031,Asha,F,22.00000,60.0,8.000000,NaN,97.0
586,1057,NaN,F,20.00000,44.0,3.000000,Civil,83.0
587,1036,Karan,NaN,20.59332,38.0,5.000000,Mech,90.0
588,1027,Rahul,Female,20.00000,89.0,8.000000,ENTC,46.0
589,1018,Neha,M,20.59332,68.0,5.369606,CS,57.0

In [18]:
df = df.dropna(subset=['Name'])
df

,Student_ID,Name,Gender,Age,Marks,Study_Hours,Department,Attendance
0,1009,Rahul,F,20.59332,49.0,10.000000,IT,40.0
1,1015,Ravi,F,20.00000,38.0,7.000000,Mech,51.0
2,1064,Karan,F,23.00000,54.0,5.000000,Civil,99.0
3,1028,Ravi,Female,23.00000,75.0,10.000000,Civil,47.0
4,1089,Amit,Male,20.59332,74.0,5.000000,Mech,42.0
...,...,...,...,...,...,...,...,...
583,1012,Rahul,M,20.00000,57.0,7.000000,Mech,79.0
585,1031,Asha,F,22.00000,60.0,8.000000,NaN,97.0
587,1036,Karan,NaN,20.59332,38.0,5.000000,Mech,90.0
588,1027,Rahul,Female,20.00000,89.0,8.000000,ENTC,46.0
589,1018,Neha,M,20.59332,68.0,5.369606,CS,57.0

In [19]:
df = df.dropna(subset=['Gender'])
df

,Student_ID,Name,Gender,Age,Marks,Study_Hours,Department,Attendance
0,1009,Rahul,F,20.59332,49.0,10.000000,IT,40.0
1,1015,Ravi,F,20.00000,38.0,7.000000,Mech,51.0
2,1064,Karan,F,23.00000,54.0,5.000000,Civil,99.0
3,1028,Ravi,Female,23.00000,75.0,10.000000,Civil,47.0
4,1089,Amit,Male,20.59332,74.0,5.000000,Mech,42.0
...,...,...,...,...,...,...,...,...
581,1030,Rahul,Male,18.00000,45.0,10.000000,ENTC,81.0
583,1012,Rahul,M,20.00000,57.0,7.000000,Mech,79.0
585,1031,Asha,F,22.00000,60.0,8.000000,NaN,97.0
588,1027,Rahul,Female,20.00000,89.0,8.000000,ENTC,46.0
589,1018,Neha,M,20.59332,68.0,5.369606,CS,57.0

In [20]:
df = df.dropna(subset=['Department'])
df

,Student_ID,Name,Gender,Age,Marks,Study_Hours,Department,Attendance
0,1009,Rahul,F,20.59332,49.0,10.000000,IT,40.0
1,1015,Ravi,F,20.00000,38.0,7.000000,Mech,51.0
2,1064,Karan,F,23.00000,54.0,5.000000,Civil,99.0
3,1028,Ravi,Female,23.00000,75.0,10.000000,Civil,47.0
4,1089,Amit,Male,20.59332,74.0,5.000000,Mech,42.0
...,...,...,...,...,...,...,...,...
580,1030,Priya,Female,20.00000,69.0,2.000000,ENTC,78.0
581,1030,Rahul,Male,18.00000,45.0,10.000000,ENTC,81.0
583,1012,Rahul,M,20.00000,57.0,7.000000,Mech,79.0
588,1027,Rahul,Female,20.00000,89.0,8.000000,ENTC,46.0
589,1018,Neha,M,20.59332,68.0,5.369606,CS,57.0

In [22]:
df['Gender'] = df['Gender'].replace({"Male":"M","Female":"F"})
df

C:\Users\patuy\AppData\Local\Temp\ipykernel_18368\3616766371.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Gender'] = df['Gender'].replace({"Male":"M","Female":"F"})

,Student_ID,Name,Gender,Age,Marks,Study_Hours,Department,Attendance
0,1009,Rahul,F,20.59332,49.0,10.000000,IT,40.0
1,1015,Ravi,F,20.00000,38.0,7.000000,Mech,51.0
2,1064,Karan,F,23.00000,54.0,5.000000,Civil,99.0
3,1028,Ravi,F,23.00000,75.0,10.000000,Civil,47.0
4,1089,Amit,M,20.59332,74.0,5.000000,Mech,42.0
...,...,...,...,...,...,...,...,...
580,1030,Priya,F,20.00000,69.0,2.000000,ENTC,78.0
581,1030,Rahul,M,18.00000,45.0,10.000000,ENTC,81.0
583,1012,Rahul,M,20.00000,57.0,7.000000,Mech,79.0
588,1027,Rahul,F,20.00000,89.0,8.000000,ENTC,46.0
589,1018,Neha,M,20.59332,68.0,5.369606,CS,57.0

In [23]:
df.isnull().sum()

Student_ID     0
Name           0
Gender         0
Age            0
Marks          0
Study_Hours    0
Department     0
Attendance     0
dtype: int64

In [24]:
df = df.sort_values("Student_ID")
df

     Student_ID   Name Gender   Age  Marks  Study_Hours Department  Attendance
97         1000  Sneha      M  23.0   81.0     3.000000       ENTC        52.0
124        1000  Sneha      M  20.0   48.0     7.000000       ENTC        82.0
229        1000  Priya      F  21.0   92.0     5.000000         IT        99.0
292        1000  Karan      M  19.0   42.0     4.000000      Civil        79.0
310        1000  Karan      F  20.0   35.0     8.000000      Civil        90.0
..          ...    ...    ...   ...    ...          ...        ...         ...
404        1097  Sneha      M  20.0   76.0     5.000000         CS        89.0
369        1097  Priya      F  23.0   86.0     6.000000         CS        92.0
390        1097  Priya      F  23.0   76.0     5.369606         CS        62.0
391        1097   Neha      F  23.0   50.0    10.000000         IT        42.0
90         1097  Karan      M  20.0   37.0    10.000000       ENTC        94.0

[366 rows x 8 columns]

In [25]:
df.duplicated().sum()

np.int64(26)